Revit 2024 API
GeometryInstance.GetInstanceGeometry Method
Overload List
Name | Description
GetInstanceGeometry()
Computes the geometric representation of the instance.
GetInstanceGeometry(Transform)
Computes a transformation of the geometric representation of the instance.
See Also
GeometryInstance Class
GeometryInstance Members
Autodesk.Revit.DB Namespace